#В переменную example запишите любую строку.
example = 'Программа'

#Выведите на экран(в консоль) первый символ этой строки.
print(example)

#Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
print(example[-1])

#Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print(example[4:9])

#Выведите на экран(в консоль) это слово наоборот.
print(example[::-1])

#Выведите на экран(в консоль) каждый второй символ этой строки.
print(example[1:9:2])